[
  {
    "Modulnummer": "IS-FCEE-00218W",
    "Modulname": "Advanced technologies of building\\nmaterials and prefabricated elements",
    "Leistungspunkte und Noten": 6,
    "Arbeitsaufwand": 168,
    "Inhalte und Qualifikationsziele": "Lecture: The issues of industrial production of construction products. Production technology: concrete, metal and wooden prefabricated elements and products, construction ceramics, cellular concrete construction products, sand-lime construction elements. Project: Technological and organizational design of a prefabricated elements factory with a given production capacity. Laboratory: Laboratory tests - the evaluation of properties and quality control of building materials and prefabricated elements"
  },
  {
    "Modulname": "Air conditioning and Ventilation systems\\n1",
    "Leistungspunkte und Noten": 5,
    "Arbeitsaufwand": 140,
    "Inhalte und Qualifikationsziele": "Lecture; Heat gains. Types of ventilation. Schemas of ventilation systems. Advantages and disadvantages of selected HVAC systems. Main elements.. Project: Heat gains. Types of ventilation. Schemas of ventilation systems. Advantages and disadvantages of selected HVAC systems. Main elements."
  },
  {
    "Modulnummer": "IS-FCEE-00025W",
    "Modulname": "Air Protection",
    "Leistungspunkte und Noten": 3,
    "Arbeitsaufwand": 84,
    "Inhalte und Qualifikationsziele": "Lecture: Basic information about atmospheric air and its pollution. Classification of types and sources of air pollution, emission, sling, immission. Criteria used to determine air quality hazards. Ambient air quality standards. Primary and secondary pollution, natural and anthropogenic. The importance of VOC in the threat of ground-level ozone. POPs impact on ambient air quality; Long-range pollution transfer. The use of the Pasquilla model to determine the extent of immission from point sources. Meteorological conditions of pollution spread. The role of freons in depleting the ozone layer. Ecological characteristics of freons. Greenhouse effect mechanism. Gases aggravating the greenhouse effect. Behavior of dusts and aerosols in the air, basic concepts. Dedusting devices. Technology of neutralizing pollutants in waste gases - absorbers, adsorbers, heat burners, bioscrubbers, cryogenic methods, wet oxidation. Communication air pollution and methods of their minimization. International conventions and protocols limiting emissions. Ecologically clean and highly efficient technologies for burning solid fuels. Principles of measuring pollutant emissions in air and waste gases, basic devices and methods of analysis. Project: identification of pollution emission sources, characteristics of individual pollution groups, assessment of the impact of emissions on quality air, selection of primary and secondary methods to reduce gaseous and dust pollutant emissions, calculation of gaseous and dust pollutant emissions, selection and design of dedusting devices."
  },
  {
    "Modulnummer": "IS-FCEE-00105-",
    "Modulname": "Alternative Energy Sources",
    "Leistungspunkte und Noten": 4,
    "Arbeitsaufwand": 112,
    "Inhalte und Qualifikationsziele": "Vvarious types of renewable energy sources. Solar Radiation. Flat Plate And Concentrating Collectors. Fundamentals of Solar Photo Voltaic Conversion, Solar Cells, Solar PV Power Generation, Solar PV Applications. Types of Wind Energy Systems. Principles of Bio-Conversion. Heat pumps, resources, types of wells."
  },
  {
    "Modulnummer": "IS-FCEE-00227S/W",
    "Modulname": "Analytical chemistry",
    "Leistungspunkte und Noten": 4,
    "Arbeitsaufwand": 112,
    "Inhalte und Qualifikationsziele": "CLASSES: Stoichiometric calculations performed during titration analysis; pH calculations; solubility product constant calculations; concentration conversion. LABORATORY: Determination of the most important physicochemical parameters of water samples including: water hardness, content of chloride ions, sulfate ions, nitrate ions, cations of various metals, selected organic compounds and many other by the use of weight method, titration, spectrophotometric, flame photometry, high performance liquid chromatography."
  },
  {
    "Modulnummer": "IS-FCEE-00270W",
    "Modulname": "M-1. Architecture and theory of design",
    "Leistungspunkte und Noten": 1,
    "Arbeitsaufwand": 28,
    "Inhalte und Qualifikationsziele": "Activities included to reach this aim are very different. They include: The aim of the classes (lectures, specialization workshop, project) is to give a basic approach to understand the general knowledge needed for the course and the team design for the project of a bus stop shelter in different European cities locations. The goal is achieved through: SW (L- Lecture): \\uf0b7 Historic Values of Cities \\uf0b7 Accessibility of public space \\uf0b7 Good practices in design \\uf0b7 City branding \\uf0b7 Cultural landscape of the city \\uf0b7 Heritage objects in public spaces of Madrid: Debod temple \\uf0b7 Small architecture objects. Serpentine Gallery, Kensington Gardens, Hyde Park 2000 – 2019 \\uf0b7 Bus stops in Krumbach (Austria) – branding of the city \\uf0b7 ACCESSIBILITY OF PUBLIC SPACE \\uf0b7 SAFETY IN PUBLIC SPACE \\uf0b7 HISTORICAL VALUES OF CITIES \\uf0b7 CULTURAL LANDSCAPE OF THE CITY – MADRID \\uf0b7 HERITAGE IN PUBLIC SPACE OF EUROPEAN CITY"
  },
  {
    "Modulnummer": "IS-FCEE-00236S",
    "Modulname": "Audit of public space accessibility",
    "Leistungspunkte und Noten": 3,
    "Arbeitsaufwand": 84,
    "Inhalte und Qualifikationsziele": "Lecture: Theoretical basis for the analysis of accessibility of the built-urban environment for different groups of users, including people with disabilities. Definition of ergonomic principles in the context of universal design and methodology for creating valorisation of space. Project: The scope of the design task includes the valorisation of a specific space in terms of its accessibility in light of the ideas and principles of universal design."
  },
  {
    "Modulnummer": "IS-FCEE-00099-1W",
    "Modulname": "Basics of building structure mechanics",
    "Leistungspunkte und Noten": 3,
    "Arbeitsaufwand": 84,
    "Inhalte und Qualifikationsziele": "Fundamentals of static analysis of determinate and indeterminate spatial structures, properties and behaviour of spatial structures, general relationships between forces and displacements, matrix formulation of the displacement method, analysis of 3-D frames by force and displacement method, 3-D trusses, arches."
  },
  {
    "Modulnummer": "IS-FCEE-00176-1W",
    "Modulname": "Basics of road engineering",
    "Leistungspunkte und Noten": 2,
    "Arbeitsaufwand": 56
  },
  {
    "Modulnummer": "IS-FCEE-00261S",
    "Modulname": "Basics of Sewerage Systems",
    "Leistungspunkte und Noten": 4,
    "Arbeitsaufwand": 112,
    "Inhalte und Qualifikationsziele": "Lectures: General information on sewage disposal systems. Computation of sewage flows. Design principles of separated and combined sewage systems. Operation and design principles of pressure and vacuum sewage systems. Hydraulic calculations of sewers. Pipe materials and sewerage appurtenances. Project: Engineering design of gravity sewer system for a small community (foul water only) Specialized workshop – application of professional computer software for hydraulic analysis of sewer system"
  }
]