[
  {
    "Modulnummer": "IS-FME-00131S",
    "Modulname": "Active Vibration Control Methods",
    "Leistungspunkte und Noten": 3,
    "Arbeitsaufwand": 84,
    "Inhalte und Qualifikationsziele": "Lecture: Some concepts of structural dynamics, piezoelectric stripes or stick as actuator, magnetorheological dampers, collocated versus non-collocated control, active damping with collocated pairs of actuator and sensors, optimal control Project: determine of the mathematical model of flexible mechanical structure with piezo-elements and next design of active vibration control system with help of Matlab software"
  },
  {
    "Modulnummer": "IS-FME-00220S",
    "Modulname": "Additive techniques of manufacturing",
    "Leistungspunkte und Noten": 3,
    "Arbeitsaufwand": 84,
    "Inhalte und Qualifikationsziele": "Characteristics of Additive Manufacturing. The generic AM process. Applications of Additive Manufacturing: Rapid Prototyping, Rapid Tooling, Rapid Manufacturing, Reverse Engineering. File formats for Additive Manufacturing: stl, amf, 3mf, obj. Categories of additive manufacturing processes: Vat photopolymerization, powder bed fusion, material extrusion, material jetting, binder jetting, directed energy deposition, sheet lamination. Materials used in Additive Manufacturing. Design for Additive Manufacturing."
  },
  {
    "Modulnummer": "IS-FME-00186S",
    "Modulname": "Advanced CAx systems",
    "Leistungspunkte und Noten": 4,
    "Arbeitsaufwand": 112,
    "Inhalte und Qualifikationsziele": "Lecture: Discussion of the CAx systems structure. Presentation of development trends and issues related to the implementation of CAx systems. Discussing sketch blocks and their use for analysing motion kinematics of sketch components. Presentation of parts modelling in the context of their further manufacturing. Defining geometric models, taking into account strength conditions. Presenting tools for automating mechatronic devices design. Making students familiar with the possibilities of parametric modelling. Making students familiar with top-to-bottom modelling of parts assemblies and with assembly modelling with the use of intelligent components. Modeling in assembly context and assembly configuration. Project: Creating models of parts, considering their manufacturing. Modelling of parametric parts. Using the tools of sheet metal and welded structures. Top-to-bottom creating of assemblies of parts and modelling assemblies using intelligent components. Modelling in the assembly context and configuring assemblies. Creating sketch blocks and performing motion kinematics analysis of sketch components."
  },
  {
    "Modulnummer": "IS-FME-00179W",
    "Modulname": "Advanced course of programming in\\nPython",
    "Leistungspunkte und Noten": 3,
    "Arbeitsaufwand": 84,
    "Inhalte und Qualifikationsziele": "Object-oriented programming: creating classes and using objects; Introduction to GUI programming using Tkinter; Widgets and Layouts; Geometry managers; Commands with buttons and timers; Events and bindings; Menu Bar; Other widgets"
  },
  {
    "Modulnummer": "IS-FME-00175S",
    "Modulname": "Analytical Mechanics",
    "Leistungspunkte und Noten": 5,
    "Arbeitsaufwand": 140,
    "Inhalte und Qualifikationsziele": "Difference between Newtonian and analytical mechanics. Constraints Classification: holonomic and non-holonomic, Generalized coordinates, velocities and forces, Equilibrium of conservative and non-conservative systems: Principle of virtual work, Dirichlet’s theory, Equations of motions: D’Alembert’s principle, Lagrange’s equations od the first and second kind, Hamilton’s equations, Principle of least action, Conservation laws, generalized momenta, properties of Lagrangian and Hamiltonian functions."
  },
  {
    "Modulnummer": "IS-MER0026W",
    "Modulname": "Automatic control",
    "Leistungspunkte und Noten": 5,
    "Arbeitsaufwand": 140,
    "Inhalte und Qualifikationsziele": "Forward and inverse kinematics of Robots; transfer function; static and dynamic properties of automation systems; basic elements of automatic systems; mathematical description of automation and robotic systems; controllers PID; control systems stability; constructing automation systems based on pneumatic elements; simulation of automation systems in MATLAB program system environment."
  },
  {
    "Modulnummer": "IS-FME-00240W",
    "Modulname": "Automation and robotization of processes",
    "Leistungspunkte und Noten": 5,
    "Arbeitsaufwand": 140,
    "Inhalte und Qualifikationsziele": "Lecture: Trends in technological development. Automation and robotization of processes according to the Fourth Industrial Revolution. Principles and objectives of discrete and continuous process automation. Production management architecture. Programming methods. Process description methods. Programming languages and algorithms: Grafcet, SFC, GRAPH, operational networks, Petri nets. Finite-state machines. Switching systems. Elements of industrial process systems (measuring, executive control, communication and SCADA systems). Automation and robotization of selected production/technological processes. Automation of decision-making processes in production planning and execution. Hierarchical control system models. Understanding electrical and signal diagrams: automation systems: relays, contactors, coils, digital and analogue PLC I/O connections, safety and security elements. Robotic systems - construction, operation and control. Robots and manipulators in industrial processes (assembly, packaging, transport, etc.). Selection of robot and manipulator configurations. Flexible robotic production cells. Cooperation of robots and manipulators with humans. Hybrid systems. Designing flexible robotic systems. Decentralized control systems of robotic cells. Remote management of industrial robots. Project classes: designing control systems with the use of the Stateflow module of the Matlab/Simulink software. Designing control systems of the Bang-Bang type. Sequential system modelling. Modelling and designing control systems for selected industrial automation systems. Designing and investigating control systems with variable regulator structures. Designing and modelling control systems for selected manufacturing processes. Laboratory classes: Programming of selected robotic systems (robotic cells)."
  },
  {
    "Modulnummer": "IS-FME-00158S",
    "Modulname": "Automobiles",
    "Leistungspunkte und Noten": 5,
    "Arbeitsaufwand": 140,
    "Inhalte und Qualifikationsziele": "Lecture: Motor vehicles classification, purpose and requirements. Vehicle construction and characteristic of its major systems. Technical characteristic and moving properties. Construction, functions and tasks of major vehicle systems. Wheel-surface system. Force and power balance. Mechatronic systems in vehicles Laboratory class: Construction and operating of motor vehicle systems"
  }
]