[
  {
    "Modulnummer": "100010",
    "Modulname": "Technische Physik",
    "Inhalte und Qualifikationsziele": "Logisch zusammenhängende Darstellung der klassischen Physik und Ein- führung in die moderne Physik im Rahmen einer experimentellen Vorlesung zu den Gebieten: • Klassische Mechanik/Elektrizität/Magnetismus/Optik • Quantenkonzept/Atome/Moleküle/Kernphysik • Festkörper/Grenzflächen/Oberflächen/Dünne Schichten Dabei sollen ausgehend von der experimentellen Erfahrung das Wesen der Physik als mathematisierte Naturwissenschaft sowie ihre technische Relevanz verdeutlicht wer- den. Wichtige physikalische Phänomene und ihre qualitative und quantitative Beschreibung werden vorgestellt. Neben Schwerpunkten der klassischen Physik werden auch moder- nere Probleme in adäquater Weise behandelt. In vorlesungsbegleitenden Übungen werden das aktive Verständnis und die Anwen- dungsbereitschaft des vermittelten Wissens trainiert. In einem physikalischen Praktikum werden einfache experimentelle Fertigkeiten und Grundlagen der Laborarbeit erlernt. Der Schwerpunkt soll dabei auf der Versuchsdurchführung und der Dokumentation und Auswertung der gewonnenen Messdaten liegen.",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "200010",
    "Modulname": "Mathematik I",
    "Inhalte und Qualifikationsziele": "• Grundlagen der Höheren Mathematik (Aussagenlogik, Mengen, Relationen, Zahlen, elementare Funktionen) • Lineare Algebra (Vektorräume, Matrizen, lineare Gleichungssysteme, Skalarprodukt, Elemente der analytischen Geometrie, Eigenwerte, Singulärwerte)",
    "Leistungspunkte und Noten": "9",
    "Arbeitsaufwand": "270"
  },
  {
    "Modulnummer": "200020",
    "Modulname": "Mathematik II",
    "Inhalte und Qualifikationsziele": "• Folgen und Reihen, Konvergenz • Grenzwerte und Stetigkeit reeller Funktionen • Differential- und Integralrechnung in einer Variablen • Gewöhnliche Differentialgleichungen • Taylor- und Fourier-Reihen • Integraltransformationen",
    "Leistungspunkte und Noten": "9",
    "Arbeitsaufwand": "270"
  },
  {
    "Modulnummer": "200030",
    "Modulname": "Mathematik III",
    "Inhalte und Qualifikationsziele": "• Differentialrechnung für Funktionen mehrerer Variablen • Integralrechnung für Funktionen mehrerer Variablen • Vektoranalysis • Diskrete Strukturen und Kombinatorik • Weiterführende algebraische Grundlagen",
    "Leistungspunkte und Noten": "9",
    "Arbeitsaufwand": "270"
  },
  {
    "Modulnummer": "500010",
    "Modulname": "Algorithmen und Datenstrukturen",
    "Inhalte und Qualifikationsziele": "Algorithmen und Programmierung: Begriff des Algorithmus; Spezifikation, Pseu- docode und Korrektheit; struktureller Entwurf; Daten und Rekursion; formale Sprachen, Grammatiken und Syntaxdiagramme; Komplexität; imperative Programmierung; ob- jektorientierte Programmierung; Datenstrukturen: abstrakte Datentypen; Listen; Bäume; Stacks; Queues; Graphen; Spei- cherkonzepte; Sortierverfahren; Suchverfahren; Hashing; geometrische Algorithmen",
    "Leistungspunkte und Noten": "16",
    "Arbeitsaufwand": "480"
  },
  {
    "Modulnummer": "500110",
    "Modulname": "Proseminar Informatik",
    "Inhalte und Qualifikationsziele": "Das Proseminar führt anhand ausgewählter Themen der Informatik in das wis- senschaftliche Arbeiten ein.",
    "Leistungspunkte und Noten": "3",
    "Arbeitsaufwand": "90"
  },
  {
    "Modulnummer": "500210",
    "Modulname": "Theoretische Informatik I",
    "Inhalte und Qualifikationsziele": "Graphalgorithmen; Random access Maschine; Laufzeitermittlung; Breiten- und Tiefensuche; Optimierung; Kürzeste Wege; Divide-and-conquer; Exponentielle Prob- leme; Erfüllbarkeit",
    "Leistungspunkte und Noten": "8",
    "Arbeitsaufwand": "240"
  },
  {
    "Modulnummer": "500270",
    "Modulname": "Hauptseminar Automobiltechnik",
    "Inhalte und Qualifikationsziele": "Im Hauptseminar arbeiten sich die Studenten selbständig in eine Thematik der Automobiltechnik ein, präsentieren sie in der Gruppe und verfassen eine Hausar- beit.",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "500290",
    "Modulname": "Teamorientiertes Praktikum",
    "Inhalte und Qualifikationsziele": "Inhalt des Moduls ist eine teamorientierte Projektarbeit. Die Studenten erhal- ten eine komplexe Entwurfsaufgabe, die sie im Team lösen. Die Teamgröße hängt von der Aufgabe ab, sollte aber mindestens drei und höchstens acht Studenten umfassen. Das Projekt kann in Absprache mit der für den Schwerpunkt verantwortlichen Profes- sur auch in der Industrie durchgeführt werden.",
    "Leistungspunkte und Noten": "16",
    "Arbeitsaufwand": "480"
  },
  {
    "Modulnummer": "551170",
    "Modulname": "Rechnerorganisation",
    "Inhalte und Qualifikationsziele": "Fast alle praktischen Rechnerbauformen basieren auf wenigen elementaren Funktions- und Strukturprinzipien. Je komplexer die Systeme werden, umso wichtiger ist ein systematisches Grundlagenwissen für deren Verständnis. Das Modul zielt auf eine konsistente Darstellung von elementaren Prozessor- bis hin zu praktisch relevanten Systemkonzepten ab und vertieft diese im Kontext mit maschi- nenorientierter Programmierung. Folgende Themen werden behandelt: • Elementare Konzepte der Rechnerorganisation • Rechen- und Steuereinheit • Speicheranordnung • Ein-/Ausgabesystem • Busse • Befehlssatzarchitekturen • Maschinenorientierte Programmierung • Computerarithmetik: ganze Zahlen, Gleitkommazahlen • Praktisch relevante Systemkonzepte am Beispiel eingebetteter Systeme und eines PCs",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "555030",
    "Modulname": "Grundlagen der Technischen Informatik",
    "Inhalte und Qualifikationsziele": "Modellierungs- und Spezifikationstechniken für digitale Funktionen; Optimie- rungsverfahren für digitale Schaltungen; Hardwarebeschreibungssprache VHDL, Steu- erwerks- und Datenpfadentwurf",
    "Leistungspunkte und Noten": "8",
    "Arbeitsaufwand": "240"
  },
  {
    "Modulnummer": "565150",
    "Modulname": "Betriebssysteme",
    "Inhalte und Qualifikationsziele": "Klassifikation von Betriebssystemen; Architekturprinzipien; Hierarchisches Schichtenmodell; Ressourcen; Aktivitätsformen; Threads; Steuerung kritischer Ab- schnitte; Prozesskommunikation; Deadlock; Datenübertragung; Speicherverwaltung; Massenspeicher; Administration; Sicherheit",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "577070",
    "Modulname": "Softwareengineering",
    "Inhalte und Qualifikationsziele": "Prinzipien des Software Engineering; Entwicklungsprozesse; Prozessanalyse und -modellierung; objektorientierte Analyse; UML; Entwurf; Testen",
    "Leistungspunkte und Noten": "8",
    "Arbeitsaufwand": "240"
  },
  {
    "Modulnummer": "222010",
    "Modulname": "Optimierung für Nichtmathematiker",
    "Inhalte und Qualifikationsziele": "Die mathematische Optimierung beschäftigt sich mit der Aufgabe, eine Ziel- funktion über einer gegebenen zulässigen Menge zu minimieren. Das Modul ist für nichtmathematische Studiengänge entworfen und gibt einen groben Überblick über Verfahren und Techniken zur Formulierung und Lösung von Klassen grundlegender Op- timierungsprobleme.",
    "Leistungspunkte und Noten": "6",
    "Arbeitsaufwand": "180"
  },
  {
    "Modulnummer": "322110",
    "Modulname": "Fahrzeugantriebsstrang",
    "Inhalte und Qualifikationsziele": "• Einführung in die Fahrzeugantriebstechnik • Leistungsbedarf eines Fahrzeugs • Kennfelder • Kennfeldwandlung • Gangabstufung • Antriebsarten • Energiespeicher • Energiewandler • Getriebe • Abtrieb • Differenzial • Einfluss auf den Kraftstoffverbrauch",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "336030",
    "Modulname": "Steuerungs- und Regelungstechnik",
    "Inhalte und Qualifikationsziele": "In zunehmendem Maße werden Niveau und Effektivität im Maschinenbau von der Automatisierungstechnik geprägt. Sie beherrscht die Steuerung von Maschinen und Anlagen, die Automatisierung ganzer Fertigungsabschnitte oder die Koordination flexibler Fertigungssysteme. Für die Automatisierung von Maschinen und Anlagen sind die Grundlagen der Steuerungs- und Regelungstechnik unerlässliche Werkzeuge. Es werden Grundkenntnisse zur Beschreibung, Berechnung und ingenieurmäßigen Be- herrschung der Steuerungs- und Regelungstechnik vermittelt. Ausgehend von Grund- begriffen und kybernetischen Grundstrukturen über Darstellungsarten und Rechenre- geln der Boole‘schen Algebra und den Entwurf von einfachen, binären Ablaufsteuerun- gen führt die Lehrveranstaltung bis zur Umsetzung auf industriellen Steuerungen. Im Teil „Regelungstechnik“ werden der Regelkreis und seine Bestandteile analysiert und erste Möglichkeiten zur Beschreibung im Zeit- und Frequenzbereich vorgestellt. Damit lassen sich Aussagen über das Verhalten beim Zusammenwirken, über Stabilität und Einstellregeln ableiten.",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "337090",
    "Modulname": "Fahrzeugsystemdesign",
    "Inhalte und Qualifikationsziele": "• Mobilitätsarten und -anforderungen • Fahrzeugmarkt • Kundenanalysen • Produktentstehungsprozess • Variantenvielfalt • Fahrzeugphysik • Fahrzeugkonzepte • Komplexitätsmanagement • Plattform-, Modul-, Baukastenstrategie • Transportation-Design und Aerodynamik • Antriebstopologien • Fahrzeugsicherheit • Herausforderungen und Trends in der Fahrzeugentwicklung",
    "Leistungspunkte und Noten": "4",
    "Arbeitsaufwand": "120"
  },
  {
    "Modulnummer": "413160",
    "Modulname": "Elektrotechnik/Elektronik I",
    "Inhalte und Qualifikationsziele": "Im Modul werden die physikalischen Grundlagen der Elektrotechnik behandelt, der Feldbegriff sowie die Begriffe Spannung, Strom, Widerstand und Leistung und die Kirchhoffschen Sätze eingeführt und einfache RLC Netze berechnet.",
    "Leistungspunkte und Noten": "4",
    "Arbeitsaufwand": "120"
  },
  {
    "Modulnummer": "426010",
    "Modulname": "Design of Digital Systems",
    "Inhalte und Qualifikationsziele": "• Entwurfsebenen und -strategien • Abläufe und Abstraktion beim Systementwurf • Systemspezifikation und HW/SW-Codesign • Modellierung, Hardwarebeschreibungssprachen • Werkzeuge für Simulation, Verifikation und Synthese",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "551130",
    "Modulname": "Rechnerarchitektur",
    "Inhalte und Qualifikationsziele": "Wer moderne Prozessoren leistungsorientiert einsetzen und program- mieren will, muss sich vertiefte Kenntnisse über bestimmte Hardwarekonzepte moderner Prozessorarchitekturen aneignen. Das Modul vermittelt entsprechende Kenntnisse, indem folgende Themen behandelt werden: • Unterschiede zwischen RISC- und CISC-Architekturen • Rechenleistung und Energieverbrauch von Prozessoren • Vergleich zwischen Prozessoren: Benchmarks • DVFS und Übertaktung • Herstellung, Zuverlässigkeit und Ausbeute • Speichertechnologien und -design • Parallelität auf Befehlsebene und Pipelines • Spekulative Ausführung • Out-of-Order-Ausführung",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "555070",
    "Modulname": "Hardware/Software-Codesign I",
    "Inhalte und Qualifikationsziele": "• Einblick in verschiedene Entwurfsmethodiken und -strukturierungen für Eingebet- tete Systeme • Überblick und Vergleich von Zielarchitekturen und -komponenten für Hard- ware/Software-Systeme • ausgewählte Probleme der Hardware- und Softwaresynthese • allgemeine Partitionierungsverfahren • Hardware/Software-Bipartitionierung",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "555190",
    "Modulname": "Hardware Development with VHDL",
    "Inhalte und Qualifikationsziele": "Die Paradigmen und Konzepte zur Implementierung von Funktionalitäten als kombinatorische oder sequentielle Digitalsysteme unterscheiden sich deutlich von den etablierten Verfahren zur Programmierung mittels imperativer Programmiersprachen. Diese Veranstaltung behandelt die Paradigmen des Hardware-Entwurfs und setzt sie in Relation zu imperativen Ansätzen. Als Beschreibungssprache für sequentielle Systeme kommt VHDL zum Einsatz. Schwerpunkte der Veranstaltung sind: • VHDL Grundlagen (Konzepte, Syntax, Semantik) • Vergleich zu imperativen Programmiersprachen • Kombinatorische Systeme und ihre Modellierung • Sequentielle Systeme und ihre Modellierung • Komponenten der Register-Transfer Ebene und ihre VHDL-Realisierung • Modellierung und Realisierung komplexer Systeme • Praktische Erfahrungen in der VHDL-Beschreibung Der praktische Umgang mit entsprechenden Entwurfsprogrammen zur Simulation und Synthese der VHDL-Beschreibungen wird ebenso vermittelt.",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "56103001.01.2010",
    "Modulname": "Multicore-Programmierung",
    "Inhalte und Qualifikationsziele": "Die Inhalte dieses Moduls umfassen: Kurzüberblick Multicore-Prozessoren, Threadansätze zur Multicore-Programmierung, Sprachansätze zur Multicore-Program- mierung, Bibliotheksansätze zur Multicore-Programmierung, Java-Threads, neue Sprachansätze, Transaktionsspeicher",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "565030",
    "Modulname": "Echtzeitsysteme",
    "Inhalte und Qualifikationsziele": "Theorie und Praxis von Rechensystemen, die zur Lösung zeitkritischer Prob- leme eingesetzt werden. Folgende Themenkreise werden angesprochen: Zeitverwal- tung, -standards, Uhren; Schedulingverfahren periodischer und aperiodischer Anforde- rungen; Ressourcenverwaltung, (priority inversion, ~ inheritance, ~ ceiling); Verwaltung von Massenspeichern; Caching und Hauptspeicherverwaltung; Fehlertoleranz in Echt- zeit-Systemen; echtzeitgeeignete Kommunikationsmechanismen und -protokolle; Pro- zessorarchitekturen für Echtzeitsysteme; Echtzeit-Betriebssysteme",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "573010",
    "Modulname": "Bildverstehen",
    "Inhalte und Qualifikationsziele": "Das Modul gibt eine Einführung in das Bildverstehen, wobei besonders Mittel und Methoden der Künstlichen Intelligenz betrachtet werden. Schwerpunkt ist das Ver- stehen von Bildern. Inhalte: • Überblick zum Bildverstehen • Grundlagen der digitalen Bildverarbeitung • Bildvorverarbeitung • Bildsegmentierung • Merkmale von Objekten • Objekterkennung • Dreidimensionale Bildinterpretation • Bewegungsanalyse – Optischer Fluss",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "57303019.05.2010",
    "Modulname": "Einführung in die Künstliche Intelligenz",
    "Inhalte und Qualifikationsziele": "Einführung in das Gebiet der Künstlichen Intelligenz unter Bearbeitung folgen- der Themen: • Intelligente Agenten • Problemformulierung und Problemtypen • Problemlösen durch Suchen • Problemlösen durch Optimieren • Logik erster Ordnung, Inferenzen und Planen • Probabilistische Methoden • Neuronale Netze • Informationstheorie • Lernen von Entscheidungsbäumen",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "578090",
    "Modulname": "Mensch-Computer-Interaktion I",
    "Inhalte und Qualifikationsziele": "Das Modul führt in die Grundlagen der Mensch-Computer-Interaktion ein. Es werden grundlegende Wirkmechanismen verschiedener Medientypen besprochen, wobei der Fokus auf ästhetischer Gestaltung und ergonomischen Aspekten liegt.",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "553110",
    "Modulname": "Rechnernetze",
    "Inhalte und Qualifikationsziele": "Der Einsatz moderner Informationstechnologie und global vernetzter Rechner- systeme hat sich in ungeahnter Weise auf nahezu alle Bereiche des alltäglichen Lebens ausgeweitet. Das Modul vermittelt die zugrunde liegenden Konzepte und Prinzipien der Telematik sowie die Grundlagen für den Aufbau von Rechnernetzen. Es werden u.a. folgende Themen behandelt: • Modelle für Kommunikation, Dienste und Protokolle • ISO/OSI-Referenzmodell und Internet-Modell • Technologien zum Netzzugang • Vermittlung und Transport von Daten • Internet-Protokolle (Internet Protocol Stack), z.B. TCP, UDP, IP • Kopplung von Rechnernetzen, z.B. Router, Gateway • Sicherheitsaspekte • Verteilte Systeme und Anwendungen, z.B. FTP, Mail, Web",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "561150",
    "Modulname": "Funktionale Programmierung",
    "Inhalte und Qualifikationsziele": "Praktische und theoretische Konzepte und Methoden funktionaler Program- miersprachen sowie Einführung in die funktionale Programmierung anhand der Pro- grammiersprache Haskell; Schwerpunkte sind funktionale Datenstrukturen, Typensysteme und Auswertungsstra- tegien.",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "563030",
    "Modulname": "Datenbanken Grundlagen",
    "Inhalte und Qualifikationsziele": "Datenmodelle; Operationen; SQL; Datenmodellierung; Physische Datenorgani- sation; Datenverwaltung; Transaktionsmanager",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "571050",
    "Modulname": "Computergraphik I",
    "Inhalte und Qualifikationsziele": "Einführung in das Gebiet der Computergraphik unter Bearbeitung folgender Themen: • Aufbau grafischer Systeme • Farbmodelle • Rasteralgorithmen • Betrachtungstransformationen • Clipping und Hidden Surface Algorithmen • Beleuchtungsmodelle und Schattierungsverfahren • Texturen",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "571210",
    "Modulname": "Solid Modeling",
    "Inhalte und Qualifikationsziele": "Moderne CAD-Systeme verwenden einen volumenorientierten Modellie- rungsansatz, der als solid modeling (Körpermodellierung) bezeichnet wird. Gegen- über einem flächenorientierten Ansatz erlaubt das vollständige Erfassen der 3 D-Ge- ometrie eines Objektes die Durchführung von Konsistenzprüfungen des Modells. In der Vorlesung werden die Grundlagen des Körper-Modellierens sowie die wichtigsten Modellierungsansätze CSG, B-rep und Zellzerlegung behandelt.",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "571250",
    "Modulname": "Virtuelle Realität",
    "Inhalte und Qualifikationsziele": "Eine Einführung in die VR-Technik mit Darstellung zentraler Anwendungen. Nachdem die VR-spezifischen Sicht- und Interaktionsgeräte und ihre Wirkprinzipien vor- gestellt wurden, stehen die VR-typischen Interaktionstechniken zur Diskussion, welche zum Navigieren in VR-Welten, zur Interaktion mit VR-Objekten sowie für ein kooperati- ves Arbeiten in Virtuellen Umgebungen zum Einsatz kommen. Einen weiteren Schwer- punkt bilden Aspekte der Modellierung Virtueller Welten, ihre Bestandteile, Struktur und Schnittstellen, bevor die prinzipielle Arbeitsweise und Systemstruktur typischer VR-Sys- teme sowie die Verwendung spezieller VR-Basissoftware für die Systementwicklung betrachtet werden.",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "573090",
    "Modulname": "Humanoide Roboter",
    "Inhalte und Qualifikationsziele": "Die Vorlesung gibt eine Einführung in die Robotik, mit besonderem Fokus auf biologisch inspirierte humanoide Roboter. Es werden verschiedene Methoden der Programmierung von Robotern zur Lösung von sensorisch-motorischen Aufgaben vorgestellt, die im Praktikum vertieft werden. Im Einzelnen werden folgende Themen behandelt: Sensorik und Aktuatorik, Kinematik, Regelung mobiler Roboter, biologisch inspirierte Roboter, Humanoide Roboter, Soziale Roboter und Mensch-Roboter Inter- aktion, Automobilinformatik, Roboethik.",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "577150",
    "Modulname": "Objektorientierte Programmierung",
    "Inhalte und Qualifikationsziele": "• Geschichte: von Simula und Smalltalk bis Java und Eiffel • Designkonzepte: Klassen, Objekte, Vererbung, Kapslung, späte Bindung • Sprachkonzepte im Vergleich: C++, C#, Eiffel, Java • Entwurfsmuster (Software Design Patterns) in OOP wie Factory, Singleton • Praktische Programmierung in einer OO-Sprache, Probleme der IRS, Relevanz, Deskriptoren und Indexierung, Normalisierung, Zipf-Gesetz, Stemming, Proximity, Fuzzy-Suche, manuelle und automatische Indexierung, Vektor-Systeme, Datenstrukturen für IRS, Suchalgorithmen, Dokument-Clustering, Wort-Clustering, Datenkompression, Text Mining, Zeichenketten in Molekularbiologie",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "578010",
    "Modulname": "Medienapplikationen",
    "Inhalte und Qualifikationsziele": "Es werden verschiedene Anwendungsfelder (E-Learning, Retrieval, IP-based Streaming, Interactive TV, Hypermedia, Mobile Devices, etc.) und ihre jeweiligen tech- nologischen Grundlagen (Codierungsverfahren, Dateiformate) besprochen.",
    "Leistungspunkte und Noten": "5",
    "Arbeitsaufwand": "150"
  },
  {
    "Modulnummer": "617180",
    "Modulname": "Einführung in das Management",
    "Inhalte und Qualifikationsziele": "Vermittlung der Grundlagen des Managements, der Organisation sowie der Führung",
    "Leistungspunkte und Noten": "4",
    "Arbeitsaufwand": "120"
  },
  {
    "Modulnummer": "745010",
    "Modulname": "Rhetorik und Kommunikation",
    "Inhalte und Qualifikationsziele": "Im Mittelpunkt stehen Kenntnisse über Grundlagen der rhetorischen Kommu- nikation. Bei der Arbeit an Rede- und Gesprächsformen wird von einem kommunikativ- dialogischen Grundverständnis ausgegangen. Schwerpunkte der Übung können sein: Kommunikationsmodelle, Arten der Redegestaltung, Gesprächskompetenz, Zusam- menhang zwischen Sprechhaltung und Sprechausdruck, Strukturierung und Aufberei- tung von Themen.",
    "Leistungspunkte und Noten": "4",
    "Arbeitsaufwand": "120"
  },
  {
    "Modulnummer": "824020",
    "Modulname": "Gesprächsführung",
    "Inhalte und Qualifikationsziele": "Im Modul werden Grundlagen der Kommunikation sowie Basisfertigkeiten der Gesprächsführung vermittelt. Rollenspiele zielen darauf ab, die zuvor erlernten Techniken und ihre Wirkung zu erproben. Die Vermittlung der Inhalte umfasst Theo- rievermittlung, Diskussionen, Einzel- und Gruppenarbeit, Rollenspiele und Übungen mit (z. T. Video-) Feedback.",
    "Leistungspunkte und Noten": "2",
    "Arbeitsaufwand": "60"
  },
  {
    "Modulnummer": "824030",
    "Modulname": "Präsentationstechniken",
    "Inhalte und Qualifikationsziele": "Die Präsentation eigener Arbeiten und der eigenen Person sind wichtige Ele- mente des Berufsalltages. Im Modul werden Selbstdarstellungstechniken und ihre Wir- kung vermittelt. Die Übungen zielen darauf ab, einen zur eigenen Persönlichkeit pas- senden individuellen Präsentationsstil zu finden. Die Vermittlung der Inhalte umfasst Theorievermittlung, Diskussionen, Einzel- und Gruppenarbeit.",
    "Leistungspunkte und Noten": "2",
    "Arbeitsaufwand": "60"
  },
  {
    "Modulnummer": "990020",
    "Modulname": "Informationskompetenz",
    "Inhalte und Qualifikationsziele": "ziele • Grundbegriffe der Informationswelt • Die Digitale Bibliothek (Bibliotheksverbünde, OPAC, EZB, ZDB, Bibliotheksdienste, Elektronisches Publizieren) • Grundlagen der Datenbankrecherche (Thematische Literaturrecherche) • Aufbau von Datenbanken (Suchfelder, Indizes, Thesaurus, Suchlogik) • Vorstellung und Recherche in fachspezifischen Datenbanken • Internet (Problematik der Suche im Internet, Fachportale, Suchmaschinen)",
    "Leistungspunkte und Noten": "2",
    "Arbeitsaufwand": "60"
  },
  {
    "Modulnummer": "SPZ_Engl_2",
    "Modulname": "Englisch in Studien- und Fachkommunikation II (Niveau B2)",
    "Inhalte und Qualifikationsziele": "Ausbau der sprachlichen Kenntnisse und Fertigkeiten mit Bezug auf studien- und berufsorientierte Sachverhalte, selbstständige Recherche, Lesen und sprachli- che Auswertung fachspezifischer Texte sowie Anwendung in der fachlichen Diskus- sion, Textanalyse und -produktion (Bewerbungsdokumente, Fachaufsätze), Vertie- fung des akademischen/ berufsspezifischen Fachwortschatzes in ausgewählten Teilgebieten, Leiten von Beratungen und Diskussionen; Die Ausbildung orientiert sich an der Sprachkompetenzstufe B2 des Gemeinsamen Europäischen Referenzrahmens für Sprachen (GER) und beinhaltet eine fachsprach- liche Komponente.",
    "Leistungspunkte und Noten": "8",
    "Arbeitsaufwand": "240"
  },
  {
    "Modulnummer": "SPZ_Engl_3",
    "Modulname": "Englisch in Studien- und Fachkommunikation III (Niveau C1)",
    "Inhalte und Qualifikationsziele": "Vertiefung des Fachwortschatzes in ausgewählten Teilgebieten und syste- matische Erweiterung des allgemeinen Wortschatzes mit Bezug auf studien- und be- rufsorientierte sowie interkulturelle Sachverhalte, Leiten von Beratungen und Diskus- sionen, Halten von Vorträgen; Die Ausbildung orientiert sich an der Sprachkompetenzstufe C1 des Gemeinsamen Europäischen Referenzrahmens für Sprachen (GER) und beinhaltet eine fachsprach- liche Komponente.",
    "Leistungspunkte und Noten": "4",
    "Arbeitsaufwand": "120"
  },
  {
    "Modulnummer": "9100_B",
    "Modulname": "Bachelor-Arbeit",
    "Inhalte und Qualifikationsziele": "Im Rahmen des Moduls wird eine Bachelorarbeit erstellt und in einem Kollo- quium verteidigt. Das Thema der Arbeit steht in inhaltlichem Zusammenhang zu Au- tomobiltechnik.",
    "Leistungspunkte und Noten": "12",
    "Arbeitsaufwand": "360"
  }
]